In [19]:
import pandas as pd
import numpy as np

In [20]:
pd.nan

AttributeError: module 'pandas' has no attribute 'nan'

In [ ]:
pd.NA

In [ ]:
pd.NaT

NaT

In [ ]:
np.nan==np.nan

False

In [ ]:
np.nan is np.nan

True

In [ ]:
df=pd.read_csv('./movie_scores.csv')
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [ ]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [ ]:
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

# Drop the data

In [ ]:
# df.dropna(thresh=2,axis=0)

In [21]:
df.dropna(subset=['last_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

# Replace

In [22]:
df.fillna("New Value")

  first_name  last_name        age        sex pre_movie_score post_movie_score
0        Tom      Hanks       63.0          m             8.0             10.0
1  New Value  New Value  New Value  New Value       New Value        New Value
2       Hugh    Jackman       51.0          m       New Value        New Value
3      Oprah    Winfrey       66.0          f             6.0              8.0
4       Emma      Stone       31.0          f             7.0              9.0

In [23]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [25]:
df['pre_movie_score'].fillna("Missing pre movie score")

0                        8.0
1    Missing pre movie score
2    Missing pre movie score
3                        6.0
4                        7.0
Name: pre_movie_score, dtype: object

In [26]:
airlines_tix={'first':100,'bussiness':np.nan,'economy-plus':50,'economy':30}

In [27]:
ser=pd.Series(airlines_tix)

In [28]:
ser

first           100.0
bussiness         NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [29]:
ser.interpolate()

first           100.0
bussiness        75.0
economy-plus     50.0
economy          30.0
dtype: float64